In [1]:
import numpy as np
import pandas as pd

## read files 读取文件

In [2]:
df_csv = pd.read_csv("./data/my_csv.csv")

In [3]:
df_csv

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [4]:
df_txt = pd.read_table("./data/my_table.txt")

In [5]:
df_txt

   col1 col2  col3             col4
0     2    a   1.4   apple 2020/1/1
1     3    b   3.4  banana 2020/1/2
2     6    c   2.5  orange 2020/1/5
3     5    d   3.2   lemon 2020/1/7

In [6]:
df_excel = pd.read_excel("./data/my_excel.xlsx")

In [7]:
df_excel

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

## no header

In [8]:
pd.read_table("./data/my_table.txt", header=None)

      0     1     2                3
0  col1  col2  col3             col4
1     2     a   1.4   apple 2020/1/1
2     3     b   3.4  banana 2020/1/2
3     6     c   2.5  orange 2020/1/5
4     5     d   3.2   lemon 2020/1/7

## index_col=[  ]

In [10]:
pd.read_csv("./data/my_csv.csv", index_col=["col1","col5"])

              col2  col3    col4
col1 col5
2    2020/1/1    a   1.4   apple
3    2020/1/2    b   3.4  banana
6    2020/1/5    c   2.5  orange
5    2020/1/7    d   3.2   lemon

## usecols=[   ]

In [13]:
pd.read_table("./data/my_table.txt",usecols=["col1","col2"])

   col1 col2
0     2    a
1     3    b
2     6    c
3     5    d

In [14]:
pd.read_excel("./data/my_excel.xlsx", usecols=["col1"])

   col1
0     2
1     3
2     6
3     5

## parse_dates()

In [15]:
pd.read_csv("./data/my_csv.csv", parse_dates=["col5"])

   col1 col2  col3    col4       col5
0     2    a   1.4   apple 2020-01-01
1     3    b   3.4  banana 2020-01-02
2     6    c   2.5  orange 2020-01-05
3     5    d   3.2   lemon 2020-01-07

## nrows= a number

In [18]:
pd.read_table("./data/my_table.txt",nrows=3, parse_dates=["col4"])

   col1 col2  col3             col4
0     2    a   1.4   apple 2020/1/1
1     3    b   3.4  banana 2020/1/2
2     6    c   2.5  orange 2020/1/5

## sep engine 特殊分隔符， txt文件

In [19]:
pd.read_table("./data/my_table_special_sep.txt")

              col1 |||| col2
0  TS |||| This is an apple.
1    GQ |||| My name is Bob.
2         WT |||| Well done!
3    PT |||| May I help you?

In [20]:
pd.read_table("./data/my_table_special_sep.txt", sep="\|\|\|\|", engine="python")

  col1                 col2
0   TS    This is an apple.
1   GQ      My name is Bob.
2   WT           Well done!
3   PT      May I help you?

# write files 保存数据

In [22]:
df_csv.to_csv("./data/chao/writeFile.csv", index=False)
df_excel.to_excel("./data/chao/writeFile.xlsx", index=False)

## 没有 to_table， 但是可以用 to_csv代替

In [23]:
df_txt.to_csv("./data/chao/table.txt",sep="\t", index=False)

# 基本数据结构

## Series 一维数据

In [2]:
ser1 = pd.Series(data=[26,17,29],index=pd.Index(["Chao","Apurva","Vova"], name="Finland"), dtype="object",name="My first Series")

In [3]:
ser1

Finland
Chao      26
Apurva    17
Vova      29
Name: My first Series, dtype: object

## access attributes

In [4]:
ser1.name

'My first Series'

In [5]:
ser1.index

Index(['Chao', 'Apurva', 'Vova'], dtype='object', name='Finland')

In [6]:
ser1.values

array([26, 17, 29], dtype=object)

In [7]:
ser1.dtype

dtype('O')

In [8]:
ser1.shape

(3,)

In [9]:
ser1.size

3

In [10]:
ser1.ndim

1

# DataFrame 二维数据

In [16]:
data = [[100,200,300],[101,201,301],[102,202,303],[103,203,303],[104,204,304]]
index = pd.Index(["a","b","c","d","e"])
cols=["one hundred","two hundred","three hundred"]

In [17]:
df1 = pd.DataFrame(data=data, index=index, columns=cols)

In [18]:
df1

   one hundred  two hundred  three hundred
a          100          200            300
b          101          201            301
c          102          202            303
d          103          203            303
e          104          204            304

## access to df attributes

In [19]:
df1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [20]:
df1.values

array([[100, 200, 300],
       [101, 201, 301],
       [102, 202, 303],
       [103, 203, 303],
       [104, 204, 304]], dtype=int64)

In [21]:
df1.columns

Index(['one hundred', 'two hundred', 'three hundred'], dtype='object')

In [22]:
df1.shape

(5, 3)

In [23]:
df1.ndim

2

In [24]:
df1.size

15

# basic functions 基本函数

In [25]:
df = pd.read_csv("./data/learn_pandas.csv")

In [26]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [27]:
df.shape

(200, 10)

In [28]:
df.ndim

2

In [29]:
df.size

2000

In [30]:
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=200, step=1)

# slicing a df 切割，只去前7列

In [34]:
df = df[df.columns[:7]]

In [35]:
df

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N
...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

## tail head 查看前后几行，默认五行

In [36]:
df.head(6)

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N
5,Tsinghua University,Freshman,Xiaoli Qian,Female,158.0,51.0,N

In [37]:
df.tail(10)

,School,Grade,Name,Gender,Height,Weight,Transfer
190,Shanghai Jiao Tong University,Junior,Changli Qin,Male,177.3,NaN,N
191,Tsinghua University,Junior,Li Sun,Female,166.6,54.0,N
192,Shanghai Jiao Tong University,Senior,Gaojuan Wang,Male,166.8,70.0,N
193,Tsinghua University,Senior,Xiaoqiang Qin,Male,193.9,79.0,N
194,Peking University,Senior,Yanmei Qian,Female,160.3,49.0,NaN
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

## 使用 .info()  .describe() 查看表信息，数据概述

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [41]:
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

## max min mean median sum quantile

In [42]:
df_demo = df.loc[:,["Height","Weight"]]

In [43]:
df_demo

     Height  Weight
0     158.9    46.0
1     166.5    70.0
2     188.9    89.0
3       NaN    41.0
4     174.0    74.0
..      ...     ...
195   153.9    46.0
196   160.9    50.0
197   153.9    45.0
198   175.3    71.0
199   155.7    51.0

[200 rows x 2 columns]

In [46]:
df_demo.max()

Height    193.9
Weight     89.0
dtype: float64

In [47]:
df_demo.min()

Height    145.4
Weight     34.0
dtype: float64

In [48]:
df_demo.mean()

Height    163.218033
Weight     55.015873
dtype: float64

In [49]:
df_demo.median()

Height    161.9
Weight     51.0
dtype: float64

In [50]:
df_demo.idxmax()

Height    193
Weight      2
dtype: int64

In [53]:
df_demo.iloc[193,:]

Height    193.9
Weight     79.0
Name: 193, dtype: float64

In [54]:
df_demo.iloc[2,:]

Height    188.9
Weight     89.0
Name: 2, dtype: float64

In [52]:
df_demo.idxmin()

Height    143
Weight     49
dtype: int64

In [55]:
df_demo.iloc[143,:]

Height    145.4
Weight     34.0
Name: 143, dtype: float64

In [56]:
df_demo.iloc[49,:]

Height    147.3
Weight     34.0
Name: 49, dtype: float64

# slicing with [], or [[]]

In [72]:
print("use single []","\n")
print(df.iloc[1],"\n")
print(type(df.iloc[1]))

use single []

School      Peking University
Grade                Freshman
Name           Changqiang You
Gender                   Male
Height                  166.5
Weight                   70.0
Transfer                    N
Name: 1, dtype: object

<class 'pandas.core.series.Series'>

In [73]:
print("use double [[]]","\n")
print(df.iloc[[1]],"\n")
print(type(df.iloc[[1]]))

use double [[]]

              School     Grade            Name Gender  Height  Weight Transfer
1  Peking University  Freshman  Changqiang You   Male   166.5    70.0        N

<class 'pandas.core.frame.DataFrame'>

In [74]:
print("use single []","\n")
print(df.iloc[1:101],"\n")
print(type(df.iloc[1:101]))

use single []

                            School      Grade            Name  Gender  Height  \
1                Peking University   Freshman  Changqiang You    Male   166.5
2    Shanghai Jiao Tong University     Senior         Mei Sun    Male   188.9
3                 Fudan University  Sophomore    Xiaojuan Sun  Female     NaN
4                 Fudan University  Sophomore     Gaojuan You    Male   174.0
5              Tsinghua University   Freshman     Xiaoli Qian  Female   158.0
..                             ...        ...             ...     ...     ...
96               Peking University   Freshman   Changmei Feng  Female   163.8
97             Tsinghua University  Sophomore   Xiaoqiang Qin  Female   160.8
98                Fudan University  Sophomore    Xiaojuan Chu    Male     NaN
99               Peking University   Freshman  Changpeng Zhao    Male   181.3
100            Tsinghua University     Senior    Xiaofeng Shi  Female   164.4

     Weight Transfer
1      70.0        N
2      89.0        N
3      41.0        N
4      74.0        N
5      51.0        N
..      ...      ...
96     56.0        N
97     54.0        N
98     68.0        N
99     83.0        N
100    55.0        N

[100 rows x 7 columns]

<class 'pandas.core.frame.DataFrame'>

In [79]:
print("use single []","\n")
print(df.iloc[:,1:7],"\n")
print(type(df.iloc[:,1:7]))

use single []

         Grade            Name  Gender  Height  Weight Transfer
0     Freshman    Gaopeng Yang  Female   158.9    46.0        N
1     Freshman  Changqiang You    Male   166.5    70.0        N
2       Senior         Mei Sun    Male   188.9    89.0        N
3    Sophomore    Xiaojuan Sun  Female     NaN    41.0        N
4    Sophomore     Gaojuan You    Male   174.0    74.0        N
..         ...             ...     ...     ...     ...      ...
195     Junior    Xiaojuan Sun  Female   153.9    46.0        N
196     Senior         Li Zhao  Female   160.9    50.0        N
197     Senior  Chengqiang Chu  Female   153.9    45.0        N
198     Senior   Chengmei Shen    Male   175.3    71.0        N
199  Sophomore     Chunpeng Lv    Male   155.7    51.0        N

[200 rows x 6 columns]

<class 'pandas.core.frame.DataFrame'>

In [80]:
print("use double [[]]","\n")
print(df.iloc[:,[1]],"\n")
print(type(df.iloc[:,[1]]))

use double [[]]

         Grade
0     Freshman
1     Freshman
2       Senior
3    Sophomore
4    Sophomore
..         ...
195     Junior
196     Senior
197     Senior
198     Senior
199  Sophomore

[200 rows x 1 columns]

<class 'pandas.core.frame.DataFrame'>

In [81]:
print("use single []","\n")
print(df.iloc[:,1],"\n")
print(type(df.iloc[:,1]))

use single []

0       Freshman
1       Freshman
2         Senior
3      Sophomore
4      Sophomore
         ...
195       Junior
196       Senior
197       Senior
198       Senior
199    Sophomore
Name: Grade, Length: 200, dtype: object

<class 'pandas.core.series.Series'>

# 单[] ，双[[]] 总结。 </br></br>当选取单独一row, 或者单独一个column， </br></br>单[]返回Series， 双[[]] 返回 dataframe

In [85]:
print(type(df.iloc[1,:]), "取一行 单[]")
print("\n\n\n")
print(type(df.iloc[[1],:]), "取一行 双[[]]")
print("\n\n\n")
print(type(df.iloc[:,1]), "取一列 单[]")
print("\n\n\n")
print(type(df.iloc[:,[1]]), "取一列 双[[]]")
print("\n\n\n")

<class 'pandas.core.series.Series'> 取一行 单[]




<class 'pandas.core.frame.DataFrame'> 取一行 双[[]]




<class 'pandas.core.series.Series'> 取一列 单[]




<class 'pandas.core.frame.DataFrame'> 取一列 双[[]]

## 唯一值

In [61]:
df.loc[:,"School"].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [62]:
df.loc[:,"School"].nunique()

4

In [89]:
df.loc[:,"School"].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

In [90]:
df_demo = df.loc[:,["Gender","Transfer","Name"]]

In [91]:
df_demo

     Gender Transfer            Name
0    Female        N    Gaopeng Yang
1      Male        N  Changqiang You
2      Male        N         Mei Sun
3    Female        N    Xiaojuan Sun
4      Male        N     Gaojuan You
..      ...      ...             ...
195  Female        N    Xiaojuan Sun
196  Female        N         Li Zhao
197  Female        N  Chengqiang Chu
198    Male        N   Chengmei Shen
199    Male        N     Chunpeng Lv

[200 rows x 3 columns]

### drop_duplicate()

In [92]:
df_demo.drop_duplicates(["Gender"])

   Gender Transfer            Name
0  Female        N    Gaopeng Yang
1    Male        N  Changqiang You

In [93]:
df_demo.drop_duplicates(["Transfer"])

    Gender Transfer          Name
0   Female        N  Gaopeng Yang
12  Female      NaN      Peng You
36    Male        Y  Xiaojuan Qin

In [94]:
df_demo.drop_duplicates(["Gender","Transfer"])

    Gender Transfer            Name
0   Female        N    Gaopeng Yang
1     Male        N  Changqiang You
12  Female      NaN        Peng You
21    Male      NaN   Xiaopeng Shen
36    Male        Y    Xiaojuan Qin
43  Female        Y      Gaoli Feng

In [95]:
df_demo.drop_duplicates(["Gender","Transfer"], keep="last")

     Gender Transfer            Name
147    Male      NaN        Juan You
150    Male        Y   Chengpeng You
169  Female        Y   Chengquan Qin
194  Female      NaN     Yanmei Qian
197  Female        N  Chengqiang Chu
199    Male        N     Chunpeng Lv

## 替换函数 replace

In [96]:
df.replace({"Female":0,"Male":1}) # 字典形式

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,0,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,1,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,1,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,0,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,1,174.0,74.0,N
...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,0,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,0,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,0,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,1,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,1,155.7,51.0,N

In [98]:
df.replace(["Freshman","Sophomore"],["First Year","Second Year"]) # 两个列表形式

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,First Year,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,First Year,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Second Year,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Second Year,Gaojuan You,Male,174.0,74.0,N
...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Second Year,Chunpeng Lv,Male,155.7,51.0,N

## Where 与 Mask 替换

In [99]:
arr_1 = np.random.normal(0,5,10)

In [100]:
arr_1

array([  2.51947425,   4.38707319,   5.52254876,   2.36602981,
         9.70420769,   1.67702826,  -5.41643937,   6.13845832,
       -11.46347739,   0.47656017])

In [101]:
ser1 = pd.Series(arr_1)

In [102]:
ser1

0     2.519474
1     4.387073
2     5.522549
3     2.366030
4     9.704208
5     1.677028
6    -5.416439
7     6.138458
8   -11.463477
9     0.476560
dtype: float64

### where 当条件判断 false 则替换。 Mask 相反， 判断条件为True，则替换。

In [103]:
ser1.where(ser1>3,0)

0    0.000000
1    4.387073
2    5.522549
3    0.000000
4    9.704208
5    0.000000
6    0.000000
7    6.138458
8    0.000000
9    0.000000
dtype: float64

In [104]:
ser1.mask(ser1>3,0)

0     2.519474
1     0.000000
2     0.000000
3     2.366030
4     0.000000
5     1.677028
6    -5.416439
7     0.000000
8   -11.463477
9     0.476560
dtype: float64

## round(), asb(), clip()

In [105]:
ser1.round()

0     3.0
1     4.0
2     6.0
3     2.0
4    10.0
5     2.0
6    -5.0
7     6.0
8   -11.0
9     0.0
dtype: float64

In [106]:
ser1.round(2)

0     2.52
1     4.39
2     5.52
3     2.37
4     9.70
5     1.68
6    -5.42
7     6.14
8   -11.46
9     0.48
dtype: float64

In [107]:
ser1.abs()

0     2.519474
1     4.387073
2     5.522549
3     2.366030
4     9.704208
5     1.677028
6     5.416439
7     6.138458
8    11.463477
9     0.476560
dtype: float64

In [109]:
ser1.clip(0,5) #替换 上下限 0，5

0    2.519474
1    4.387073
2    5.000000
3    2.366030
4    5.000000
5    1.677028
6    0.000000
7    5.000000
8    0.000000
9    0.476560
dtype: float64

# 排序函数

In [111]:
df_demo = df[['Grade', 'Name', 'Height', 'Weight']].set_index(['Grade','Name'])
df_demo.head(10)

                          Height  Weight
Grade     Name
Freshman  Gaopeng Yang     158.9    46.0
          Changqiang You   166.5    70.0
Senior    Mei Sun          188.9    89.0
Sophomore Xiaojuan Sun       NaN    41.0
          Gaojuan You      174.0    74.0
Freshman  Xiaoli Qian      158.0    51.0
          Qiang Chu        162.5    52.0
Junior    Gaoqiang Qian    161.9    50.0
Freshman  Changli Zhang    163.0    48.0
Junior    Juan Xu          164.8     NaN

## sort_values()

In [112]:
df_demo.sort_values("Height",ascending=False)

                         Height  Weight
Grade     Name
Senior    Xiaoqiang Qin   193.9    79.0
          Mei Sun         188.9    89.0
          Gaoli Zhao      186.5    83.0
Freshman  Qiang Han       185.3    87.0
Senior    Qiang Zheng     183.9    87.0
...                         ...     ...
Junior    Chengli Sun       NaN    62.0
          Yanpeng Han       NaN    44.0
Sophomore Li Qin            NaN    76.0
          Yanjuan You       NaN    55.0
Freshman  Yanjuan Zhao      NaN    53.0

[200 rows x 2 columns]

In [113]:
df_demo.sort_values("Weight",ascending=True)

                         Height  Weight
Grade     Name
Junior    Xiaoli Chu      145.4    34.0
Sophomore Peng Han        147.8    34.0
Senior    Gaomei Lv       147.3    34.0
Sophomore Qiang Zhou      150.5    36.0
Freshman  Qiang Han       151.8    38.0
...                         ...     ...
          Peng Zhang      163.1     NaN
Junior    Qiang Sun       160.8     NaN
Senior    Qiang Shi       157.7     NaN
          Chunpeng Qian   161.6     NaN
Junior    Changli Qin     177.3     NaN

[200 rows x 2 columns]

In [115]:
df_demo.sort_values(["Height","Weight"],ascending=[False,True]) # 从高到低，从瘦到胖  瘦长 -> 矮胖

                         Height  Weight
Grade     Name
Senior    Xiaoqiang Qin   193.9    79.0
          Mei Sun         188.9    89.0
          Gaoli Zhao      186.5    83.0
Freshman  Qiang Han       185.3    87.0
Senior    Qiang Zheng     183.9    87.0
...                         ...     ...
Sophomore Xiaojuan Chu      NaN    68.0
          Li Qin            NaN    76.0
Freshman  Xiaojuan Qin      NaN    79.0
Sophomore Yanfeng Han       NaN     NaN
Junior    Chengli Zhao      NaN     NaN

[200 rows x 2 columns]

In [117]:
df_demo.sort_index(level="Grade", ascending=True)

                           Height  Weight
Grade     Name
Freshman  Changli Zhang     163.0    48.0
          Changmei Feng     163.8    56.0
          Changmei Lv       172.2    75.0
          Changpeng Zhao    181.3    83.0
          Changqiang Yang   156.0    49.0
...                           ...     ...
Sophomore Yanfeng Han         NaN     NaN
          Yanfeng Qian      160.1    48.0
          Yanjuan You         NaN    55.0
          Yanli Qin         169.4    74.0
          Yanquan Lv        174.6     NaN

[200 rows x 2 columns]

In [118]:
df_demo.sort_index(level="Name", ascending=False)

                         Height  Weight
Grade     Name
Freshman  Yanquan Wang    163.5    55.0
Sophomore Yanquan Lv      174.6     NaN
Freshman  Yanqiang Xu     152.4    38.0
          Yanqiang Feng   162.3    51.0
          Yanpeng Lv        NaN    65.0
...                         ...     ...
Senior    Changli Lv      148.7    41.0
Sophomore Changjuan You   150.5    40.0
Junior    Changjuan You   161.4    47.0
          Changjuan Xu    159.6    49.0
          Changfeng Lv    175.6    76.0

[200 rows x 2 columns]

In [119]:
df_demo.sort_index(level=["Name","Grade"], ascending=[False,True])

                         Height  Weight
Grade     Name
Freshman  Yanquan Wang    163.5    55.0
Sophomore Yanquan Lv      174.6     NaN
Freshman  Yanqiang Xu     152.4    38.0
          Yanqiang Feng   162.3    51.0
          Yanpeng Lv        NaN    65.0
...                         ...     ...
Senior    Changli Lv      148.7    41.0
Junior    Changjuan You   161.4    47.0
Sophomore Changjuan You   150.5    40.0
Junior    Changjuan Xu    159.6    49.0
          Changfeng Lv    175.6    76.0

[200 rows x 2 columns]

In [121]:
df_demo = df.loc[:,["Height","Weight"]]

## dataframe apply

In [122]:
df_demo.apply(lambda x: x.mean())

Height    163.218033
Weight     55.015873
dtype: float64

In [123]:
df_demo.apply(lambda x: x.median())

Height    161.9
Weight     51.0
dtype: float64

In [124]:
df_demo.apply(lambda x: x.max())

Height    193.9
Weight     89.0
dtype: float64

In [125]:
df_demo.apply(lambda x: x.min())

Height    145.4
Weight     34.0
dtype: float64

In [128]:
df_demo.apply(lambda x: x.sum(), axis=0)

Height    29868.9
Weight    10398.0
dtype: float64

In [129]:
df_demo.apply(lambda x: x.sum(), axis=1)

0      204.9
1      236.5
2      277.9
3       41.0
4      248.0
       ...
195    199.9
196    210.9
197    198.9
198    246.3
199    206.7
Length: 200, dtype: float64